Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИдентификаторыТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4380d8c9-cbf4-44cf-b7c9-1da41ff5be61">
    <name>гкс_Обслуживание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67f4d7dd-7bf2-4031-a04a-7940d981637a">
    <name>гкс_Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Enums/торо_СтатусыНормативныхРемонтовИТехКарт/торо_СтатусыНормативныхРемонтовИТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СтатусыНормативныхРемонтовИТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="670db8b6-a1e6-4c96-bfe5-81ae11f212c2">
    <name>ВРазработке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="14134500-fdf0-48e5-83c2-3f92aba5cf2f">
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3e8d26ed-f54a-46c4-8e61-6040f607ae89">
    <name>Закрыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Релиз 1] Куст 17.03.2020
	Если Параметры.Свойство("ОтборПоТОР") Тогда
		ОтборПоСтатусам = Новый Массив();
		ОтборПоСтатусам.Добавить(Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует);
		ОтборПоСтатусам.Добавить(Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"Статус", ОтборПоСтатусам, ВидСравненияКомпоновкиДанных.ВСписке);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"гкс_Владелец", Параметры.ОтборПоТОР, ВидСравненияКомпоновкиДанных.Равно);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	// гкс- [Релиз 1] Куст 17.03.2020
	// гкс+ [Подбор ТехКарт] Куст 14.10.2020
	ДобавитьНовыеЭлементы();
	Если Параметры.Свойство("ОтборПоТОРИзОР") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ОбъектыРемонта.ТиповойОР КАК ТОР
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры["ОтборПоТОРИзОР"]);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();			
			Выборка.Следующий();
			ЭтаФорма["ОтборТОР"] = Выборка.ТОР;
			Элементы["гкс_ИспользоватьОтборТОР"].Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	// гкс- [Подбор ТехКарт] Куст 14.10.2020
	// Гкс+[TOIR20-374] Лебедев Н.А. от 29.06.2023. Добавлено:{
	Элементы.НормаВремени.Видимость = Ложь;
	// } Гкс-[TOIR20-374] Лебедев Н.А. от 29.06.2023.
КонецПроцедуры

// гкс+ [Подбор ТехКарт] Куст 14.10.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИспользоватьОтборТОР", Новый ОписаниеТипов("Булево"),));	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОтборТОР", 
		Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"),));	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	НЭлем = Элементы.Добавить("гкс_ИспользоватьОтборТОР",Тип("ПолеФормы"));
	НЭлем.ПутьКДанным = "гкс_ИспользоватьОтборТОР";
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.Видимость = Ложь;
	НЭлем.Заголовок = НСтр("ru='Только для модели';en='Model only'");
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ИспользоватьОтборТОРПриИзменении");
КонецПроцедуры
// гкс- [Подбор ТехКарт] Куст 14.10.2020

// гкс+ [Подбор ТехКарт] Куст 14.10.2020
&НаКлиенте
Процедура гкс_ИспользоватьОтборТОРПриИзменении(Элемент)
	гкс_ИспользоватьОтборТОРПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура гкс_ИспользоватьОтборТОРПриИзмененииНаСервере()
	Если ЭтаФорма["гкс_ИспользоватьОтборТОР"] Тогда 
		МассивРодителей = Новый Массив();
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка,
			|	торо_ИдентификаторыТехКарт.ЭтоГруппа КАК ЭтоГруппа
			|ПОМЕСТИТЬ Уровень1
			|ИЗ
			|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
			|ГДЕ
			|	торо_ИдентификаторыТехКарт.гкс_Владелец = &гкс_Владелец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка,
			|	торо_ИдентификаторыТехКарт.ЭтоГруппа КАК ЭтоГруппа
			|ПОМЕСТИТЬ Уровень2
			|ИЗ
			|	Уровень1 КАК Уровень1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
			|		ПО Уровень1.Ссылка = торо_ИдентификаторыТехКарт.Родитель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка,
			|	торо_ИдентификаторыТехКарт.ЭтоГруппа КАК ЭтоГруппа
			|ПОМЕСТИТЬ Уровень3
			|ИЗ
			|	Уровень2 КАК Уровень1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
			|		ПО Уровень1.Ссылка = торо_ИдентификаторыТехКарт.Родитель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка,
			|	торо_ИдентификаторыТехКарт.ЭтоГруппа КАК ЭтоГруппа
			|ПОМЕСТИТЬ Уровень4
			|ИЗ
			|	Уровень3 КАК Уровень1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
			|		ПО Уровень1.Ссылка = торо_ИдентификаторыТехКарт.Родитель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Уровень1.Ссылка КАК Ссылка
			|ИЗ
			|	Уровень1 КАК Уровень1
			|ГДЕ
			|	Уровень1.ЭтоГруппа = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Уровень1.Ссылка
			|ИЗ
			|	Уровень2 КАК Уровень1
			|ГДЕ
			|	Уровень1.ЭтоГруппа = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Уровень1.Ссылка
			|ИЗ
			|	Уровень3 КАК Уровень1
			|ГДЕ
			|	Уровень1.ЭтоГруппа = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Уровень1.Ссылка
			|ИЗ
			|	Уровень4 КАК Уровень1
			|ГДЕ
			|	Уровень1.ЭтоГруппа = ИСТИНА";
		
		Запрос.УстановитьПараметр("гкс_Владелец", ЭтотОбъект["ОтборТОР"]);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивРодителей.Добавить(Выборка.Ссылка);
			КонецЦикла;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Родитель", МассивРодителей, ВидСравненияКомпоновкиДанных.ВСписке);
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"гкс_Владелец");
		Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
	КонецЕсли;
КонецПроцедуры
// гкс- [Подбор ТехКарт] Куст 14.10.2020
#КонецОбласти
